export const productData = [
    {
      id: 1,
      name: 'Отвертка универсальная',
      category: 'Инструменты',
      subcategory: 'Ручные инструменты',
      rating: 4.7,
      salesCount: 500,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Престиж',
      manufacturer: 'Инструменты',
      article: '458963',
      price: 2990,
      currency: '₽',
      availableColors: ['Черный', 'Оранжевый', 'Синий'],
      weight: '250 г',
      dimensions: '20 см x 5 см x 3 см',
      material: 'Металл с антикоррозийным покрытием',
      stock: 15,
      warranty: '12 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз', 'Доставка в пункт выдачи'],
      description: [
        `Представляем вам наши утеплённые перчатки — идеальный выбор для защиты ваших рук в холодное время года. Эти перчатки обеспечивают комфорт и тепло даже в самые суровые морозы.<br><br>Перчатки оснащены качественным утеплителем, который сохраняет тепло и обеспечивает отличную термоизоляцию. Материал: изготовлены из прочного и износостойкого материала, который обеспечивает долговечность и надёжность.`
      ],
      instruction: [
        `Перед использованием убедитесь, что продукт находится в исправном состоянии.<br><br>2. Соблюдайте меры предосторожности при работе с инструментом.`
      ],
      specifications: [
        { title: 'Материал', content: 'Прочный металл с антикоррозийным покрытием' },
        { title: 'Дизайн', content: 'Эргономичная ручка для удобного хвата' },
        { title: 'Применение', content: 'Подходит для домашнего и профессионального использования' }
      ]
    },
     {
      id: 2,
      name: 'Отвертка с изоляцией',
      category: 'Инструменты',
      subcategory: 'Ручные инструменты',
      rating: 4.8,
      salesCount: 400,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/2.jpg',
        '/images/productData/3.webp',
        '/images/productData/4.webp'
      ],
      brand: 'Инструмент',
      manufacturer: 'Технологии Инструментов',
      article: '459764',
      price: 3300,
      currency: '₽',
      availableColors: ['Красный', 'Желтый', 'Черный'],
      weight: '300 г',
      dimensions: '22 см x 5 см x 3.5 см',
      material: 'Металл с защитным покрытием',
      stock: 20,
      warranty: '18 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз'],
      description:
        'Надежная отвертка с изоляцией, разработанная для работы с электрическими приборами. Максимальная безопасность и комфорт.',
      specifications: [
        { title: 'Материал', content: 'Изолированный металл' },
        { title: 'Дизайн', content: 'Прорезиненная рукоятка' },
        { title: 'Применение', content: 'Работа с электрическими системами' }
      ]
    },
    {
      id: 3,
      name: 'Отвертка ударопрочная',
      category: 'Инструменты',
      subcategory: 'Ручные инструменты',
      rating: 4.5,
      salesCount: 350,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Мастер',
      manufacturer: 'Надежность Инструментов',
      article: '459765',
      price: 2500,
      currency: '₽',
      availableColors: ['Синий', 'Черный'],
      weight: '320 г',
      dimensions: '23 см x 5 см x 3.5 см',
      material: 'Усиленный металл',
      stock: 15,
      warranty: '12 месяцев',
      deliveryOptions: ['Самовывоз'],
      description:
        'Прочная отвертка для тяжелых условий эксплуатации. Надежный инструмент для профессионалов.',
      specifications: [
        { title: 'Материал', content: 'Усиленный металл' },
        { title: 'Дизайн', content: 'Противоскользящая рукоятка' },
        { title: 'Применение', content: 'Ремонт сложных систем' }
      ]
    },
    {
      id: 4,
      name: 'Отвертка с магнитным наконечником',
      category: 'Инструменты',
      subcategory: 'Ручные инструменты',
      rating: 4.7,
      salesCount: 450,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Техно Инструмент',
      manufacturer: 'Магнит',
      article: '459766',
      price: 3100,
      currency: '₽',
      availableColors: ['Черный', 'Серый'],
      weight: '280 г',
      dimensions: '20 см x 5 см x 3 см',
      material: 'Металл с магнитным покрытием',
      stock: 25,
      warranty: '24 месяца',
      deliveryOptions: ['Курьерская доставка'],
      description:
        'Отвертка с магнитным наконечником для удобной работы с мелкими деталями.',
      specifications: [
        { title: 'Материал', content: 'Металл с магнитным покрытием' },
        { title: 'Дизайн', content: 'Эргономичная форма' },
        { title: 'Применение', content: 'Работа с электроникой' }
      ]
    },
    {
      id: 5,
      name: 'Отвертка универсальная',
      category: 'Инструменты',
      subcategory: 'Ручные инструменты',
      rating: 4.9,
      salesCount: 500,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Универсал Инструмент',
      manufacturer: 'Инновации',
      article: '459767',
      price: 2900,
      currency: '₽',
      availableColors: ['Желтый', 'Черный'],
      weight: '270 г',
      dimensions: '21 см x 5 см x 3.2 см',
      material: 'Металл',
      stock: 30,
      warranty: '12 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз'],
      description:
        'Универсальная отвертка для любых задач. Идеальный инструмент для дома и работы.',
      specifications: [
        { title: 'Материал', content: 'Металл' },
        { title: 'Дизайн', content: 'Удобный хват' },
        { title: 'Применение', content: 'Для любых задач' }
      ]
    },
    {
      id: 6,
      name: 'Отвертка для точных работ',
      category: 'Инструменты',
      subcategory: 'Ручные инструменты',
      rating: 4.6,
      salesCount: 300,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Инструмент',
      manufacturer: 'Прецизионные Инструменты',
      article: '459768',
      price: 3200,
      currency: '₽',
      availableColors: ['Серый', 'Черный'],
      weight: '200 г',
      dimensions: '19 см x 4 см x 2.5 см',
      material: 'Закалённая сталь',
      stock: 20,
      warranty: '12 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз'],
      description:
        'Идеальная отвертка для точных работ. Превосходное качество и долговечность.',
      specifications: [
        { title: 'Материал', content: 'Закалённая сталь' },
        { title: 'Дизайн', content: 'Узкий наконечник' },
        { title: 'Применение', content: 'Ремонт электроники' }
      ]
    },
    {
      id: 7,
      name: 'Отвертка с подсветкой',
      category: 'Инструменты',
      subcategory: 'Ручные инструменты',
      rating: 4.8,
      salesCount: 600,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Инструмент',
      manufacturer: 'Освещённый Инструмент',
      article: '459769',
      price: 3500,
      currency: '₽',
      availableColors: ['Черный', 'Красный'],
      weight: '290 г',
      dimensions: '22 см x 5 см x 3.5 см',
      material: 'Металл с LED-подсветкой',
      stock: 10,
      warranty: '24 месяца',
      deliveryOptions: ['Курьерская доставка'],
      description:
        'Отвертка с встроенной подсветкой для работы в условиях недостаточного освещения.',
      specifications: [
        { title: 'Материал', content: 'Металл с LED-подсветкой' },
        { title: 'Дизайн', content: 'Прорезиненная ручка' },
        { title: 'Применение', content: 'Ремонт в тёмных местах' }
      ]
    },
    {
      id: 8,
      name: 'Отвертка с набором насадок',
      category: 'Инструменты',
      subcategory: 'Ручные инструменты',
      rating: 4.9,
      salesCount: 700,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Универсальный Инструмент',
      manufacturer: 'Наборы',
      article: '459770',
      price: 4200,
      currency: '₽',
      availableColors: ['Синий', 'Черный'],
      weight: '450 г',
      dimensions: '25 см x 6 см x 4 см',
      material: 'Металл с антикоррозийным покрытием',
      stock: 5,
      warranty: '36 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз'],
      description:
        'Отвертка с набором универсальных насадок. Всё необходимое в одном инструменте.',
      specifications: [
        { title: 'Материал', content: 'Металл с антикоррозийным покрытием' },
        { title: 'Дизайн', content: 'Компактный кейс для хранения' },
        { title: 'Применение', content: 'Для дома и работы' }
      ]
    }    
  ];

  export const manufacturers = [
    "Инструменты",
    "Технологии",
    "Надежность",
    "Инновации", 
    "Освещённый",
    "Наборы"
  ];

  export const dryMixes = [
    "Затирки",
    "Керамзит, песок, щебень",
    "Клей для утепления фасадов",
    "Наливные полы и стяжка",
    "Пескобетон и смеси универсальные",
    "Плиточный клей",
    "Шпаклевка гипсовая",
    "Штукатурка гипсовая",
    "Кладочные и монтажные растворы",
    "Шпаклевки готовые к применению",
    "Затирки",
    "Затирки",
  ];

// Константа для способов оплаты
export const paymentMethods = [
  "МИР",
  "Mastercard",
  "Visa",
  "Спб",
  "Халва"
];

// Константа для контактных данных
export const defaultContactData = {
  name: "",
  phone: "",
  email: ""
};

export const catalogData = [
  {
    category: "Стройматериалы",
    subcategories: [
      {
        name: "Стеновые и фасадные материалы",
        subcategory2: [
          {
            name: "Кирпич",
            products: [
              { id: 9, name: "Кирпич красный" }, /*ПРИМЕР */
              { id: 10, name: "Кирпич силикатный" }/*ПРИМЕР */
            ]
          },
          {
            name: "Строительные блоки",
            products: [
              { id: 11, name: "Газобетонные блоки" },
              { id: 12, name: "Керамзитобетонные блоки" },
              { id: 13, name: "Фундаментные блоки (ФБС)" }
            ]
          },
          {
            name: "Пазогребневые плиты и комплектующие",
            products: [
              { id: 14, name: "Комплектующие для пазогребневых плит" }
            ]
          },
          {
            name: "Фасадные панели и комплектующие",
            products: [
              { id: 15, name: "Гибкие фасадные панели" },
              { id: 16, name: "Фасадные облицовочные панели" },
              { id: 17, name: "Комплектующие для фасадных панелей" }
            ]
          },
          {
            name: "Сайдинг и комплектующие",
            products: [
              { id: 18, name: "Сайдинг корабельный брус" },
              { id: 19, name: "Сайдинг блок-хаус" },
              { id: 20, name: "Сайдинг брус" },
              { id: 21, name: "Комплектующие для сайдинга" },
              { id: 22, name: "Софиты и ветровая доска" },
              { id: 23, name: "Фиброцементный сайдинг" }
            ]
          },
          {
            name: "Искусственный камень",
            products: []
          },
          {
            name: "Профнастил стеновой",
            products: []
          },
          {
            name: "Фасадная клинкерная плитка",
            products: []
          }
        ]
      },
      {
        name: "Кровля и водосточные системы",
        subcategory2: [
          {
            name: "Водосточные системы и отливы",
            products: [
              { id: 24, name: "Водосточная система металлическая 125/90" },
              { id: 25, name: "Водосточная система пластиковая 120/80" },
              { id: 26, name: "Водосточная система пластиковая 120/85" },
              { id: 27, name: "Водосточная система пластиковая 140/100" },
              { id: 28, name: "Водосточные желоба" },
              { id: 29, name: "Водосточные трубы" },
              { id: 30, name: "Водосточные воронки и заглушки" },
              { id: 31, name: "Водосточные колена" },
              { id: 32, name: "Кронштейны и соединители водосточного желоба" },
              { id: 33, name: "Хомуты и муфты водосточной трубы" },
              { id: 34, name: "Отливы" }
            ]
          },
          {
            name: "Металлочерепица и комплектующие",
            products: [
              { id: 35, name: "Металлочерепица" },
              { id: 36, name: "Доборные элементы для кровли" },
              { id: 37, name: "Саморезы для металлочерепицы" }
            ]
          },
          {
            name: "Гибкая черепица и комплектующие",
            products: [
              { id: 38, name: "Гибкая черепица" },
              { id: 39, name: "Комплектующие для гибкой черепицы" }
            ]
          },
          {
            name: "Ондулин и комплектующие",
            products: [
              { id: 40, name: "Ондулин" },
              { id: 41, name: "Комплектующие для ондулина" }
            ]
          },
          {
            name: "Профнастил и оцинкованные листы",
            products: [
              { id: 42, name: "Оцинкованные листы" },
              { id: 43, name: "Профнастил и комплектующие" },
              { id: 44, name: "Саморезы для профнастила" }
            ]
          },
          {
            name: "Поликарбонат и козырьки",
            products: [
              { id: 45, name: "Поликарбонат" },
              { id: 46, name: "Комплектующие для поликарбоната" },
              { id: 47, name: "Козырьки" }
            ]
          },
          {
            name: "Наплавляемая кровля",
            products: []
          },
          {
            name: "Рубероид",
            products: []
          },
          {
            name: "Шифер",
            products: []
          },
          {
            name: "Подшивка кровли",
            products: []
          },
          {
            name: "Кровельная вентиляция",
            products: [
              { id: 48, name: "Вентиляция для плоской кровли" },
              { id: 49, name: "Вентиляция для скатной кровли" }
            ]
          },
          {
            name: "Кровельная гидроизоляция",
            products: [
              { id: 50, name: "Гидроизоляционные ленты" },
              { id: 51, name: "Битум" },
              { id: 52, name: "Герметики кровельные" },
              { id: 53, name: "Мастики кровельные" }
            ]
          },
          {
            name: "Кровельные мембраны",
            products: []
          },
          {
            name: "Полимерные мембраны",
            products: []
          }
        ]
      },
      {
        name: "Теплоизоляция и шумоизоляция",
        subcategory2: [
          {
            name: "Теплоизоляция",
            products: [
              { id: 54, name: "Минеральная вата" },
              { id: 55, name: "Экструдированный пенополистирол" },
              { id: 56, name: "Пенополистирол" },
              { id: 57, name: "Теплоизоляционные PIR-плиты" },
              { id: 58, name: "Отражающая изоляция" },
              { id: 59, name: "Напыляемая теплоизоляция" },
              { id: 60, name: "Утепление каркасных конструкций и скатных кровель" },
              { id: 61, name: "Утепление для фундамента" },
              { id: 62, name: "Утепление в системе Вентилируемый фасад" },
              { id: 63, name: "Утепление в системе Штукатурный фасад" },
              { id: 64, name: "Утепление в системе Плоская кровля" },
              { id: 65, name: "Межвенцовые и жгутовые утеплители" },
              { id: 66, name: "Утепление бани и сауны" },
              { id: 67, name: "Утепление полов и перекрытий" },
              { id: 68, name: "Плиты МДВП" },
              { id: 69, name: "Клей для теплоизоляции" },
              { id: 70, name: "Крепеж для теплоизоляции" }
            ]
          },
          {
            name: "Шумоизоляция и виброизоляция",
            products: [
              { id: 71, name: "Плиты шумоизоляционные" },
              { id: 72, name: "Панели звукоизоляционные" },
              { id: 73, name: "Маты звукоизоляционные" },
              { id: 74, name: "Рулонная шумоизоляция" },
              { id: 75, name: "Мембраны звукоизоляционные" },
              { id: 76, name: "Звукоизоляционные листовые материалы" },
              { id: 77, name: "Звукоизоляция для стен" },
              { id: 78, name: "Звукоизоляция для пола" },
              { id: 79, name: "Звукоизоляция для потолка" },
              { id: 80, name: "Комплектующие для шумоизоляции" }
            ]
          },
          {
            name: "Ветро-влагозащита и пароизоляция кровли и фасадов",
            products: []
          }
        ]
      },
      {
        name: "Материалы для сухого строительства",
        subcategory2: [
          {
            name: "Листовые материалы",
            products: [
              { id: 81, name: "Гипсокартон (ГКЛ)" },
              { id: 82, name: "Гипсоволокнистые листы (ГВЛ)" },
              { id: 83, name: "Аквапанели" },
              { id: 84, name: "Огнеупорные и огнезащитные листовые материалы" },
              { id: 85, name: "Стекломагниевые листы (СМЛ)" },
              { id: 86, name: "Цементно-перлитовые плиты" },
              { id: 87, name: "Строительные теплоизоляционные плиты" },
              { id: 88, name: "Вспененные ПВХ листы" }
            ]
          },
          {
            name: "Профиль для гипсокартона и аксессуары",
            products: [
              { id: 89, name: "Профиль для гипсокартона" },
              { id: 90, name: "Аксессуары для металлокаркаса" },
              { id: 91, name: "Ленты уплотнительные для профилей" },
              { id: 92, name: "Ленты для швов листовых материалов" },
              { id: 93, name: "Комплектующие для сборных оснований пола" }
            ]
          },
          {
            name: "Профиль для монтажа панелей",
            products: []
          },
          {
            name: "Универсальный строительный профиль (ЛСТК)",
            products: [
              { id: 94, name: "Комплекты профилей ЛСТК" },
              { id: 95, name: "Профили ЛСТК" }
            ]
          }
        ]
      },
      {
        name: "Сухие строительные смеси",
        subcategory2: [
          {
            name: "Цементно-песчаные смеси",
            products: []
          },
          {
            name: "Ровнители для пола",
            products: [
              { id: 96, name: "Цементные и гипсоцементные ровнители" },
              { id: 97, name: "Эпоксидные и полиуретановые полы" }
            ]
          },
          {
            name: "Штукатурки",
            products: [
              { id: 98, name: "Готовые штукатурки" },
              { id: 99, name: "Сухие штукатурки" }
            ]
          },
          {
            name: "Шпаклевки",
            products: [
              { id: 100, name: "Сухие шпаклевки" },
              { id: 101, name: "Готовые шпаклевки" }
            ]
          },
          {
            name: "Кладочные и монтажные смеси",
            products: [
              { id: 102, name: "Клей для печей и каминов" },
              { id: 103, name: "Кладочные смеси" },
              { id: 104, name: "Клей для блоков и ГКЛ" },
              { id: 105, name: "Клей для теплоизоляции, штукатурно-клеевая смесь" }
            ]
          },
          {
            name: "Смеси для печей и каминов",
            products: [
              { id: 106, name: "Клей для каминов и печей" },
              { id: 107, name: "Смесь кладочная для печей" },
              { id: 108, name: "Штукатурка для печей" }
            ]
          },
          {
            name: "Смеси для фасадов",
            products: [
              { id: 109, name: "Штукатурка фасадная" },
              { id: 110, name: "Штукатурка декоративная" },
              { id: 111, name: "Шпаклевка фасадная" },
              { id: 112, name: "Смесь штукатурно-клеевая" },
              { id: 113, name: "Клей для теплоизоляционных плит" },
              { id: 114, name: "Грунты для фасада" }
            ]
          },
          {
            name: "Ремонтные составы",
            products: []
          },
          {
            name: "Клей для плитки и затирки",
            products: [
              { id: 115, name: "Клей для плитки" },
              { id: 116, name: "Затирки для плитки" }
            ]
          },
          {
            name: "Добавки в растворы",
            products: [
              { id: 117, name: "Антифризы" },
              { id: 118, name: "Гидрофобизаторы для бетона" },
              { id: 119, name: "Красители для бетона" },
              { id: 120, name: "Обеспыливатели" },
              { id: 121, name: "Пластификаторы" },
              { id: 122, name: "Фиброволокно" }
            ]
          },
          {
            name: "Комплектующие для штукатурных работ и выравнивания полов",
            products: [
              { id: 123, name: "Профили штукатурные" },
              { id: 124, name: "Штукатурные сетки" },
              { id: 125, name: "Ленты демпферные" }
            ]
          }
        ]
      },
      {
        name: "Цемент и сыпучие материалы",
        subcategory2: [
          {
            name: "Цемент",
            products: []
          },
          {
            name: "Песок",
            products: []
          },
          {
            name: "Керамзит",
            products: []
          },
          {
            name: "Мел, гипс, глина, известь",
            products: []
          },
          {
            name: "Щебень, отсев, асфальт",
            products: []
          }
        ]
      },
      {
        name: "Сваи",
        subcategory2: [
          {
            name: "Сваи забивные",
            products: []
          },
          {
            name: "Винтовые сваи и комплектующие",
            products: []
          }
        ]
      },
      {
        name: "Древесно-плитные материалы",
        subcategory2: [
          {
            name: "ДВП",
            products: []
          },
          {
            name: "ДСП",
            products: []
          },
          {
            name: "ЛДСП",
            products: []
          },
          {
            name: "МДВП",
            products: []
          },
          {
            name: "Мебельные щиты",
            products: []
          },
          {
            name: "Плиты OSB-3",
            products: []
          },
          {
            name: "Фанера",
            products: []
          },
          {
            name: "ЦСП (Цементно-стружечная плита)",
            products: []
          }
        ]
      },
      {
        name: "Пиломатериалы и отделка деревом",
        subcategory2: [
          {
            name: "Доски",
            products: [
              { id: 126, name: "Доска строительная" },
              { id: 127, name: "Полок для бани и сауны" },
              { id: 128, name: "Палубная доска" },
              { id: 129, name: "Шпунтованная доска" }
            ]
          },
          {
            name: "Брус",
            products: []
          },
          {
            name: "Брусок",
            products: []
          },
          {
            name: "Вагонка",
            products: []
          },
          {
            name: "Имитация бревна и бруса",
            products: []
          },
          {
            name: "Планкен",
            products: []
          },
          {
            name: "Террасная доска и декинг",
            products: [
              { id: 130, name: "Террасная доска" },
              { id: 131, name: "Изделия из древесно-полимерного композита" },
              { id: 132, name: "Комплектующие для ДПК" }
            ]
          },
          {
            name: "Погонажные изделия",
            products: [
              { id: 133, name: "Деревянные наличники" },
              { id: 134, name: "Деревянные плинтусы" },
              { id: 135, name: "Уголки, штапики, раскладки" }
            ]
          }
        ]
      },
      {
        name: "Гидроизоляция",
        subcategory2: [
          {
            name: "Цементная гидроизоляция",
            products: []
          },
          {
            name: "Полимерная гидроизоляция",
            products: []
          },
          {
            name: "Аксессуары для гидроизоляции",
            products: []
          },
          {
            name: "Битумная гидроизоляция",
            products: []
          },
          {
            name: "Рулонная гидроизоляция",
            products: []
          },
          {
            name: "Ленты гидроизоляционные",
            products: []
          },
          {
            name: "Жидкое стекло для гидроизоляции",
            products: []
          },
          {
            name: "Гидрошпонки",
            products: []
          },
          {
            name: "Профилированные мембраны",
            products: []
          }
        ]
      },
      {
        name: "Заборы и ограждения",
        subcategory2: [
          {
            name: "Ворота и калитки",
            products: []
          },
          {
            name: "Столбы для забора и комплектующие",
            products: []
          },
          {
            name: "Колпаки для заборных столбов",
            products: []
          },
          {
            name: "Секционные заборы",
            products: []
          },
          {
            name: "Евроштакетник",
            products: []
          },
          {
            name: "Профнастил заборный",
            products: []
          },
          {
            name: "Сетка для забора и проволока",
            products: []
          },
          {
            name: "Габионы",
            products: []
          },
          {
            name: "Сваи для забора",
            products: []
          },
          {
            name: "Автоматика для ворот",
            products: []
          },
          {
            name: "Шлагбаумы и автоматизация",
            products: []
          }
        ]
      },
      {
        name: "Строительные расходные материалы",
        subcategory2: [
          {
            name: "Тенты и защитные сетки",
            products: []
          },
          {
            name: "Укрывные пленки",
            products: []
          }
        ]
      },
      {
        name: "Тротуарная плитка, бордюры и решетки",
        subcategory2: [
          {
            name: "Бордюрный камень",
            products: []
          },
          {
            name: "Клинкер тротуарный",
            products: []
          },
          {
            name: "Плитка тротуарная",
            products: []
          },
          {
            name: "Поверхностный водоотвод",
            products: []
          },
          {
            name: "Резиновые и полимерные покрытия, каменный ковер",
            products: []
          },
          {
            name: "Решетки газонные",
            products: []
          },
          {
            name: "Уличная тактильная плитка",
            products: []
          }
        ]
      } 
    ]
  }, 
  
  {
    category: "Инструменты",   /*2 категория */
    subcategories: [
      {
        name: "Ручной инструмент",
        subcategory2: [
          { name: "Зажимные инструменты и устройства", products: [] },
          { name: "Монтажный и крепежный инструмент", products: [] },
          { name: "Режущий инструмент", products: [] },
          { name: "Ударно-рычажный инструмент", products: [] },
          {
            name: "Столярно-слесарный инструмент", /* ПРИМЕР */
            products: [
              { id: 1, name: "Отвертка универсальная" }, /* ПРИМЕР */
              { id: 2, name: "Отвертка с изоляцией" }, /* ПРИМЕР */
              { id: 3, name: "Отвертка ударопрочная" }, /* ПРИМЕР */
              { id: 4, name: "Отвертка с магнитным наконечником" }, /* ПРИМЕР */
              { id: 5, name: "Отвертка универсальная" }, /* ПРИМЕР */
              { id: 6, name: "Отвертка для точных работ" }, /* ПРИМЕР */
              { id: 7, name: "Отвертка с подсветкой" }, /* ПРИМЕР */
              { id: 8, name: "Отвертка с набором насадок" } /* ПРИМЕР */
            ]
          },
          { name: "Наборы инструментов", products: [] }
        ]
      },
      {
        name: "Электроинструмент",
        subcategory2: [
          { name: "Аккумуляторный электроинструмент", products: [] },
          { name: "Дрели и шуруповерты", products: [] },
          { name: "Перфораторы", products: [] },
          { name: "Наборы электроинструмента", products: [] },
          { name: "Реноваторы, граверы, мфу", products: [] },
          { name: "Электрорубанки", products: [] },
          { name: "Фрезеры", products: [] },
          { name: "Пильно-отрезной инструмент", products: [] },
          { name: "Шлифовальные машины", products: [] },
          { name: "Строительные пистолеты", products: [] },
          { name: "Фены строительные", products: [] },
          { name: "Инструмент для пайки", products: [] },
          { name: "Строительные миксеры", products: [] },
          { name: "Отбойные молотки", products: [] },
          { name: "Точила", products: [] },
          { name: "Пылесосы", products: [] },
          { name: "Краскопульты", products: [] }
        ]
      },
      {
        name: "Расходные материалы к электроинструменту",
        subcategory2: [
          { name: "Масла и смазки", products: [] },
          { name: "Аккумуляторы для инструмента", products: [] },
          { name: "Расходные материалы для компрессоров", products: [] },
          { name: "Расходные материалы для пил", products: [] },
          { name: "Оснастка для шлифмашин", products: [] },
          { name: "Оснастка для УШМ", products: [] },
          { name: "Оснастка для дрелей и перфораторов", products: [] },
          { name: "Биты для шуруповерта", products: [] },
          { name: "Оснастка для фрезеров", products: [] },
          { name: "Комплектующие для виброплит", products: [] },
          { name: "Круги и диски", products: [] },
          { name: "Венчики для строительных миксеров", products: [] },
          { name: "Комплектующие для монтажных и клеевых пистолетов", products: [] },
          { name: "Комплектующие к пылесосам", products: [] },
          { name: "Коронки", products: [] },
          { name: "Насадки для электроинструмента", products: [] },
          { name: "Расходные материалы для нейлеров", products: [] },
          { name: "Расходные материалы для штукатурных машин", products: [] }
        ]
      },
      {
        name: "Малярный инструмент",
        subcategory2: [
          {
            name: "Валики",
            products: [
              { id: 136, name: "Игольчатые валики" },
              { id: 137, name: "Малярные валики" },
              { id: 138, name: "Прижимные валики" }
            ]
          },
          { name: "Кисти", products: [] },
          { name: "Пады малярные", products: [] },
          {
            name: "Сопутствующий малярный инструмент",
            products: [
              { id: 139, name: "Ванночки, ковши, кюветы для краски" },
              { id: 140, name: "Губки малярные" },
              { id: 141, name: "Малярные ленты" },
              { id: 142, name: "Ручки для валика" },
              { id: 143, name: "Удлинители телескопические" }
            ]
          },
          { name: "Краскораспылители", products: [] }
        ]
      },
      {
        name: "Штукатурный инструмент",
        subcategory2: [
          { name: "Кельмы, гладилки, расшивки, ковши", products: [] },
          { name: "Правила", products: [] },
          { name: "Терки, полутерки", products: [] },
          { name: "Шпатели, скребки", products: [] }
        ]
      },
      {
        name: "Специализированный инструмент",
        subcategory2: [
          { name: "Грузоподъемное оборудование", products: [] },
          { name: "Инструмент для работы с плиткой", products: [] },
          { name: "Инструмент для газобетона", products: [] },
          { name: "Инструмент для гипсокартона", products: [] },
          { name: "Инструмент для сайдинга и водосточной системы", products: [] },
          { name: "Инструмент для укладки напольных покрытий", products: [] },
          { name: "Инструмент сантехнический", products: [] },
          { name: "Электротехнический инструмент", products: [] }
        ]
      },
      {
        name: "Абразивные материалы",
        subcategory2: [
          { name: "Ленты наждачные", products: [] },
          { name: "Листы шлифовальные", products: [] },
          { name: "Шлифовальные круги", products: [] },
          { name: "Бумага наждачная", products: [] },
          { name: "Шлифовальные губки и блоки", products: [] }
        ]
      },
      {
        name: "Хозтовары и расходные материалы",
        subcategory2: [
          { name: "Коробки", products: [] },
          { name: "Пакеты", products: [] },
          { name: "Стретч-плёнка", products: [] },
          { name: "Мешки", products: [] },
          { name: "Скотч, лента, изолента", products: [] },
          { name: "Укрывные материалы", products: [] },
          { name: "Строительные емкости", products: [] }
        ]
      },
      {
        name: "Хранение инструмента",
        subcategory2: [
          { name: "Стеллажи и полки", products: [] },
          { name: "Сумки и рюкзаки", products: [] },
          { name: "Ящики для инструмента", products: [] }
        ]
      },
      {
        name: "Газовое и сварочное оборудование",
        subcategory2: [
          { name: "Газовые баллоны", products: [] },
          { name: "Защита сварщика", products: [] },
          { name: "Газовые горелки, резаки и комплектующие", products: [] },
          { name: "Лампы паяльные и комплектующие", products: [] },
          { name: "Сварочные аппараты", products: [] },
          { name: "Сварочные принадлежности", products: [] },
          { name: "Сварочные электроды и проволока", products: [] }
        ]
      },
      {
        name: "Средства защиты",
        subcategory2: [
          { name: "Безопасность работ", products: [] },
          { name: "Защита лица, глаз, головы", products: [] },
          { name: "Защита органов дыхания", products: [] },
          { name: "Защита органов слуха", products: [] },
          { name: "Защита рук", products: [] },
          { name: "Ремни и пояса", products: [] }
        ]
      }
    ]
  },
  {
    category: "Электрика", /* 3 категория */
    subcategories: [
      {
        name: "Розетки, выключатели",
        subcategory2: [
          { name: "Выключатели и розетки по коллекциям", products: [] },
          { name: "Розетки", products: [
              { id: 144, name: "Штепсельные розетки" },
              { id: 145, name: "Компьютерные розетки" },
              { id: 146, name: "Розетки USB" },
              { id: 147, name: "Комбинированные розетки" },
              { id: 148, name: "Телевизионные розетки" },
              { id: 149, name: "Розетки HDMI" },
              { id: 150, name: "Акустические розетки" },
              { id: 151, name: "Телефонные розетки" },
              { id: 152, name: "Вывод кабеля" }
          ] },
          { name: "Выключатели", products: [] },
          { name: "Рамки для розеток и выключателей", products: [] },
          { name: "Блоки выключателей и розеток", products: [] },
          { name: "Заглушки для розеток", products: [] },
          { name: "Клавиши для выключателей", products: [] },
          { name: "Накладки для розеток и выключателей", products: [] },
          { name: "Умные розетки и выключатели", products: [] },
          { name: "Щитовые розетки", products: [] }
        ]
      },
      {
        name: "Освещение",
        subcategory2: [
          { name: "Лампы", products: [
              { id: 153, name: "Светодиодные лампы" },
              { id: 154, name: "Лампы накаливания" },
              { id: 155, name: "Люминесцентные лампы" },
              { id: 156, name: "Галогенные лампы" },
              { id: 157, name: "Лампы декоративные" }
          ] },
          { name: "Прожекторы", products: [] },
          { name: "Освещение жилых помещений", products: [
              { id: 158, name: "Встраиваемые светильники" },
              { id: 159, name: "Накладные светильники" },
              { id: 160, name: "Светильники для влажных помещений" },
              { id: 161, name: "Светодиодная лента и комплектующие" }
          ] },
          { name: "Переносные светильники", products: [] },
          { name: "Технические светильники", products: [] },
          { name: "Светильники для ЖКХ", products: [] },
          { name: "Комплектующие для светильников", products: [] },
          { name: "Фонари", products: [] }
        ]
      },
      {
        name: "Товары для сборки щитка",
        subcategory2: [
          { name: "Оборудование щитовое", products: [] },
          { name: "Оборудование низковольтное", products: [] },
          { name: "Комплектующие для низковольтного оборудования и щитов", products: [] },
          { name: "Монтажный провод", products: [] },
          { name: "Комплектующие для электромонтажа", products: [] }
        ]
      },
      {
        name: "Низковольтное оборудование",
        subcategory2: [
          { name: "Автоматические выключатели", products: [] },
          { name: "Устройства защитного отключения (УЗО)", products: [] },
          { name: "Устройства защиты от импульсных перенапряжений (УЗИП)", products: [] },
          { name: "Плавкие предохранители", products: [] },
          { name: "Переключатели на DIN-рейку", products: [] },
          { name: "Контакторы", products: [] },
          { name: "Реле", products: [] },
          { name: "Рубильники", products: [] },
          { name: "Устройства защиты от дугового пробоя (УЗДП)", products: [] },
          { name: "Светосигнальная и управляющая арматура", products: [] },
          { name: "Приборы измерения и учета", products: [] },
          { name: "Пускатели", products: [] },
          { name: "Понижающие трансформаторы", products: [] },
          { name: "Частотные преобразователи", products: [] }
        ]
      },
      {
        name: "Щитовое оборудование",
        subcategory2: [
          { name: "Распределительные щиты", products: [] },
          { name: "Щиты учетно-распределительные", products: [] },
          { name: "Слаботочные щиты", products: [] },
          { name: "Коробки под автомат", products: [] },
          { name: "Распределительные щиты встраиваемые", products: [] },
          { name: "Распределительные щиты навесные", products: [] },
          { name: "Щиты с монтажной панелью", products: [] }
        ]
      },
      {
        name: "Комплектующие для щитов и низковольтного оборудования",
        subcategory2: [
          { name: "DIN-рейки", products: [] },
          { name: "Клеммные колодки", products: [] },
          { name: "Расцепители", products: [] },
          { name: "Нулевые шины", products: [] },
          { name: "Арматура светосигнальная и управляющая", products: [] },
          { name: "Гермовводы", products: [] },
          { name: "Шины соединительные", products: [] },
          { name: "Дополнительные и вспомогательные контакты", products: [] },
          { name: "Розетки на DIN-рейку", products: [] },
          { name: "Комплектующие для сборных щитов", products: [] },
          { name: "Распределительные блоки на DIN-рейку", products: [] },
          { name: "Наклейки, таблички", products: [] },
          { name: "Замки для щитов", products: [] },
          { name: "Окна для щитов", products: [] },
          { name: "Рукоятки для рубильников", products: [] },
          { name: "Системы поддержания микроклимата", products: [] },
          { name: "Комплекты крепления щита", products: [] },
          { name: "Заглушки для автоматов", products: [] },
          { name: "Поводки заземления", products: [] },
          { name: "Электроприводы для автоматических выключателей", products: [] },
          { name: "Ручные приводы для автоматических выключателей", products: [] }
        ]
      },
      {
        name: "Удлинители, разветвители",
        subcategory2: [
          { name: "Вилки и розетки для подключения электроплит", products: [] },
          { name: "Вилки штепсельные", products: [] },
          { name: "Разветвители для розеток", products: [] },
          { name: "Розеточные колодки", products: [] },
          { name: "Сетевые фильтры", products: [] },
          { name: "Силовые разъемы", products: [] },
          { name: "Удлинители бытовые", products: [] },
          { name: "Удлинители силовые", products: [] },
          { name: "Умные удлинители", products: [] },
          { name: "Шнуры сетевые", products: [] },
          { name: "Штепсельные гнезда", products: [] }
        ]
      },
      {
        name: "Аксессуары для электромонтажа",
        subcategory2: [
          { name: "Изоляция, крепление и маркировка", products: [] },
          { name: "Кабельная арматура", products: [] },
          { name: "Клеммные зажимы", products: [] }
        ]
      },
      {
        name: "Товары для разводки кабеля",
        subcategory2: [
          { name: "Кабель и провод", products: [] },
          { name: "Кабеленесущие системы", products: [] },
          { name: "Коробки монтажные", products: [] },
          { name: "Аксессуары для кабеля и провода", products: [] },
          { name: "Крепления для кабеля", products: [] },
          { name: "Инструмент электротехнический", products: [] },
          { name: "Таблички и наклейки", products: [] }
        ]
      },
      {
        name: "Кабель, провод",
        subcategory2: [
          { name: "Силовой кабель", products: [] },
          { name: "Провод монтажный", products: [] },
          { name: "Витая пара (интернет-кабель) и комплектующие", products: [] },
          { name: "СИП кабель и комплектующие", products: [] },
          { name: "Коаксиальный кабель (ТВ кабель) и комплектующие", products: [] },
          { name: "Акустический кабель", products: [] },
          { name: "Ретро-кабель и аксессуары", products: [] },
          { name: "Телефонный кабель и комплектующие", products: [] },
          { name: "Греющий кабель", products: [] },
          { name: "Кабель для видеонаблюдения", products: [] },
          { name: "Кабель для сауны", products: [] },
          { name: "Кабель для мобильных устройств", products: [] }
        ]
      },
      {
        name: "Системы прокладки кабеля",
        subcategory2: [
          { name: "Кабель-каналы и аксессуары", products: [] },
          { name: "Кабельные лотки и аксессуары", products: [] },
          { name: "Коробки распределительные и подрозетники", products: [] },
          { name: "Трубы для кабеля и комплектующие", products: [] }
        ]
      },
      {
        name: "Монтажные коробки",
        subcategory2: [
          { name: "Коробки распределительные", products: [] },
          { name: "Подрозетники", products: [] },
          { name: "Подрозетники звукоизоляционные", products: [] }
        ]
      }      
    ]
  },
  {
    category: "Металлопрокат", /* 4 категория */ 
    subcategories: [
      {
        name: "Металлопрокат",
        subcategory2: [
          {
            name: "Арматура и комплектующие",
            products: [
              { id: 220, name: "Арматура" },
              { id: 221, name: "Композитная арматура" },
              { id: 222, name: "Стальная арматура" },
              { id: 223, name: "Вязальная проволока" },
              { id: 224, name: "Комплектующие для опалубки" }
            ]
          },
          {
            name: "Сетки армирующие",
            products: [
              { id: 225, name: "Сетки арматурные" },
              { id: 226, name: "Сетки кладочные" },
              { id: 227, name: "Сетки штукатурные" }
            ]
          },
          { name: "Уголок стальной", products: [] },
          { name: "Трубы ВГП и электросварные", products: [] },
          { name: "Трубы профильные стальные", products: [] },
          { name: "Полоса стальная", products: [] },
          { name: "Квадрат стальной", products: [] },
          { name: "Швеллер стальной", products: [] },
          { name: "Двутавр", products: [] },
          { name: "Лист стальной", products: [] },
          { name: "Лист рифленый", products: [] },
          { name: "Лист просечно-вытяжной (ПВЛ)", products: [] },
          { name: "Закладные детали", products: [] }
        ]
      }
    ]
  }  
];


/*
export const catalogData = [
  {
    category: "Строительные материалы",
    subcategories: [
      {
        name: "Цемент, песок, щебень",
        products: [
          { id: 9, name: "Портландцемент М400" },
          { id: 10, name: "Песок речной строительный" },
          { id: 11, name: "Гранитный щебень 20-40 мм" },
          { id: 12, name: "Цементная смесь для кладки" }
        ]
      },
      {
        name: "Кирпич и блоки",
        products: [
          { id: 13, name: "Кирпич облицовочный красный" },
          { id: 14, name: "Газоблок D500" },
          { id: 15, name: "Кирпич силикатный белый" },
          { id: 16, name: "Керамические блоки Porotherm" }
        ]
      },
      {
        name: "Сухие смеси",
        products: [
          { id: 17, name: "Штукатурка гипсовая Knauf" },
          { id: 18, name: "Клей для плитки Ceresit" },
          { id: 19, name: "Ровнитель для пола Bergauf" },
          { id: 20, name: "Гидроизоляционная смесь Weber" }
        ]
      },
      {
        name: "Гипсокартон и профили",
        products: [
          { id: 21, name: "Гипсокартон Knauf влагостойкий" },
          { id: 22, name: "Профиль CD 60" },
          { id: 23, name: "Профиль UD 27" },
          { id: 24, name: "Гипсокартон обычный" }
        ]
      },
      {
        name: "Изоляционные материалы",
        products: [
          { id: 25, name: "Минеральная вата Rockwool" },
          { id: 26, name: "Пенопласт ПСБ-С-25" },
          { id: 27, name: "Теплоизоляция PIR" },
          { id: 28, name: "Звукоизоляция Isover" }
        ]
      }
    ]
  },
  {
    category: "Электрика",
    subcategories: [
      {
        name: "Светильники и лампы",
        products: [
          { id: 29, name: "Светодиодная лампа 10Вт" },
          { id: 30, name: "Настольная лампа с диммером" },
          { id: 31, name: "Встраиваемый светильник" },
          { id: 32, name: "Уличный прожектор 50Вт" }
        ]
      }
    ]
  },
  {
    category: "Инструменты",
    subcategories: [
      {
        name: "Ручные инструменты",
        products: [
          { id: 1, name: "Отвертка универсальная" },
          { id: 2, name: "Отвертка с изоляцией" },
          { id: 3, name: "Отвертка ударопрочная" },
          { id: 4, name: "Отвертка с магнитным наконечником" },
          { id: 5, name: "Отвертка универсальная" },
          { id: 6, name: "Отвертка для точных работ" },
          { id: 7, name: "Отвертка с подсветкой" },
          { id: 8, name: "Отвертка с набором насадок" }
        ]
      },
      {
        name: "Электроинструменты",
        products: [
          { id: 33, name: "Перфоратор Bosch" },
          { id: 34, name: "Дрель ударная Makita" },
          { id: 35, name: "Шуруповерт аккумуляторный" },
          { id: 36, name: "Угловая шлифмашина DeWalt" }
        ]
      }
    ]
  },
  {
    category: "Хозяйственный инвентарь",
    subcategories: [
      {
        name: "Уборочный инвентарь",
        products: [
          { id: 37, name: "Швабра с ведром" },
          { id: 38, name: "Губки для мытья посуды" },
          { id: 39, name: "Моющий пылесос" },
          { id: 40, name: "Совок с щеткой" }
        ]
      }
    ]
  }
];*/



export const categorySubcategoriesData = [
  {
    categoryName: "Строительные материалы",
    subcategories: [
      "Стеновые и фасадные материалы",
      "Кровля и водосточные системы",
      "Теплоизоляция и шумоизоляция",
      "Материалы для сухого строительства",
      "Сухие строительные смеси",
      "Цемент и сыпучие материалы",
      "Сваи",
      "Древесно-плитные материалы",
      "Пиломатериалы и отделка деревом",
      "Гидроизоляция",
      "Заборы и ограждения",
      "Строительные расходные материалы",
      "Тротуарная плитка, бордюры и решетки"
    ]
  },
  {
    categoryName: "Инструменты",
    subcategories: [
      "Ручной инструмент",
      "Электроинструмент",
      "Расходные материалы к электроинструменту",
      "Малярный инструмент",
      "Штукатурный инструмент",
      "Специализированный инструмент",
      "Абразивные материалы",
      "Хозтовары и расходные материалы",
      "Хранение инструмента",
      "Газовое и сварочное оборудование",
      "Средства защиты"
    ]
  },
  {
    categoryName: "Электрика",
    subcategories: [
      "Розетки, выключатели",
      "Освещение",
      "Товары для сборки щитка",
      "Низковольтное оборудование",
      "Щитовое оборудование",
      "Комплектующие для щитов и низковольтного оборудования",
      "Удлинители, разветвители",
      "Аксессуары для электромонтажа",
      "Товары для разводки кабеля",
      "Кабель, провод",
      "Системы прокладки кабеля",
      "Монтажные коробки"
    ]
  },
  {
    categoryName: "Металлопрокат",
    subcategories: [
      "Арматура и комплектующие",
      "Сетки армирующие",
      "Уголок стальной",
      "Трубы ВГП и электросварные",
      "Трубы профильные стальные",
      "Полоса стальная",
      "Квадрат стальной",
      "Швеллер стальной",
      "Двутавр",
      "Лист стальной",
      "Лист рифленый",
      "Лист просечно-вытяжной (ПВЛ)",
      "Закладные детали"
    ]
  }
];


  export const colors = ['Черный', 'Оранжевый', 'Синий', 'Красный'];

  export const recommendedProducts = [
    {
      id: 2,
      name: 'Отвертка с изоляцией',
      rating: 4.8,
      salesCount: 400,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/2.jpg',
        '/images/productData/3.webp',
        '/images/productData/4.webp'
      ],
      brand: 'Инструмент Плюс',
      manufacturer: 'ООО Технологии Инструментов',
      article: '459764',
      price: 3300,
      currency: '₽',
      availableColors: ['Красный', 'Желтый', 'Черный'],
      weight: '300 г',
      dimensions: '22 см x 5 см x 3.5 см',
      material: 'Металл с защитным покрытием',
      stock: 20,
      warranty: '18 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз'],
      description:
        'Надежная отвертка с изоляцией, разработанная для работы с электрическими приборами. Максимальная безопасность и комфорт.',
      specifications: [
        { title: 'Материал', content: 'Изолированный металл' },
        { title: 'Дизайн', content: 'Прорезиненная рукоятка' },
        { title: 'Применение', content: 'Работа с электрическими системами' }
      ]
    },
    {
      id: 3,
      name: 'Отвертка ударопрочная',
      rating: 4.5,
      salesCount: 350,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Мастер Инструмент',
      manufacturer: 'ООО Надежность Инструментов',
      article: '459765',
      price: 2500,
      currency: '₽',
      availableColors: ['Синий', 'Черный'],
      weight: '320 г',
      dimensions: '23 см x 5 см x 3.5 см',
      material: 'Усиленный металл',
      stock: 15,
      warranty: '12 месяцев',
      deliveryOptions: ['Самовывоз'],
      description:
        'Прочная отвертка для тяжелых условий эксплуатации. Надежный инструмент для профессионалов.',
      specifications: [
        { title: 'Материал', content: 'Усиленный металл' },
        { title: 'Дизайн', content: 'Противоскользящая рукоятка' },
        { title: 'Применение', content: 'Ремонт сложных систем' }
      ]
    },
    {
      id: 4,
      name: 'Отвертка с магнитным наконечником',
      rating: 4.7,
      salesCount: 450,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Техно Инструмент',
      manufacturer: 'ООО Магнит Инструмент',
      article: '459766',
      price: 3100,
      currency: '₽',
      availableColors: ['Черный', 'Серый'],
      weight: '280 г',
      dimensions: '20 см x 5 см x 3 см',
      material: 'Металл с магнитным покрытием',
      stock: 25,
      warranty: '24 месяца',
      deliveryOptions: ['Курьерская доставка'],
      description:
        'Отвертка с магнитным наконечником для удобной работы с мелкими деталями.',
      specifications: [
        { title: 'Материал', content: 'Металл с магнитным покрытием' },
        { title: 'Дизайн', content: 'Эргономичная форма' },
        { title: 'Применение', content: 'Работа с электроникой' }
      ]
    },
    {
      id: 5,
      name: 'Отвертка универсальная',
      rating: 4.9,
      salesCount: 500,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Универсал Инструмент',
      manufacturer: 'ООО Инновации Инструментов',
      article: '459767',
      price: 2900,
      currency: '₽',
      availableColors: ['Желтый', 'Черный'],
      weight: '270 г',
      dimensions: '21 см x 5 см x 3.2 см',
      material: 'Металл',
      stock: 30,
      warranty: '12 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз'],
      description:
        'Универсальная отвертка для любых задач. Идеальный инструмент для дома и работы.',
      specifications: [
        { title: 'Материал', content: 'Металл' },
        { title: 'Дизайн', content: 'Удобный хват' },
        { title: 'Применение', content: 'Для любых задач' }
      ]
    }
  ];
  

export const cities = [
  "Москва",
  "Санкт-Петербург",
  "Новосибирск",
  "Екатеринбург",
  "Казань",
  "Нижний Новгород",
  "Челябинск",
  "Самара",
  "Омск",
  "Ростов-на-Дону",
  "Уфа",
  "Красноярск",
  "Пермь",
  "Волгоград",
  "Воронеж"
];


  export const popularProducts = [
    {
      id: 2,
      name: 'Отвертка с изоляцией',
      rating: 4.8,
      salesCount: 400,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/2.jpg',
        '/images/productData/3.webp',
        '/images/productData/4.webp'
      ],
      brand: 'Инструмент Плюс',
      manufacturer: 'ООО Технологии Инструментов',
      article: '459764',
      price: 3300,
      currency: '₽',
      availableColors: ['Красный', 'Желтый', 'Черный'],
      weight: '300 г',
      dimensions: '22 см x 5 см x 3.5 см',
      material: 'Металл с защитным покрытием',
      stock: 20,
      warranty: '18 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз'],
      description:
        'Надежная отвертка с изоляцией, разработанная для работы с электрическими приборами. Максимальная безопасность и комфорт.',
      specifications: [
        { title: 'Материал', content: 'Изолированный металл' },
        { title: 'Дизайн', content: 'Прорезиненная рукоятка' },
        { title: 'Применение', content: 'Работа с электрическими системами' }
      ]
    },
    {
      id: 3,
      name: 'Отвертка ударопрочная',
      rating: 4.5,
      salesCount: 350,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Мастер Инструмент',
      manufacturer: 'ООО Надежность Инструментов',
      article: '459765',
      price: 2500,
      currency: '₽',
      availableColors: ['Синий', 'Черный'],
      weight: '320 г',
      dimensions: '23 см x 5 см x 3.5 см',
      material: 'Усиленный металл',
      stock: 15,
      warranty: '12 месяцев',
      deliveryOptions: ['Самовывоз'],
      description:
        'Прочная отвертка для тяжелых условий эксплуатации. Надежный инструмент для профессионалов.',
      specifications: [
        { title: 'Материал', content: 'Усиленный металл' },
        { title: 'Дизайн', content: 'Противоскользящая рукоятка' },
        { title: 'Применение', content: 'Ремонт сложных систем' }
      ]
    },
    {
      id: 4,
      name: 'Отвертка с магнитным наконечником',
      rating: 4.7,
      salesCount: 450,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Техно Инструмент',
      manufacturer: 'ООО Магнит Инструмент',
      article: '459766',
      price: 3100,
      currency: '₽',
      availableColors: ['Черный', 'Серый'],
      weight: '280 г',
      dimensions: '20 см x 5 см x 3 см',
      material: 'Металл с магнитным покрытием',
      stock: 25,
      warranty: '24 месяца',
      deliveryOptions: ['Курьерская доставка'],
      description:
        'Отвертка с магнитным наконечником для удобной работы с мелкими деталями.',
      specifications: [
        { title: 'Материал', content: 'Металл с магнитным покрытием' },
        { title: 'Дизайн', content: 'Эргономичная форма' },
        { title: 'Применение', content: 'Работа с электроникой' }
      ]
    },
    {
      id: 5,
      name: 'Отвертка универсальная',
      rating: 4.9,
      salesCount: 500,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Универсал Инструмент',
      manufacturer: 'ООО Инновации Инструментов',
      article: '459767',
      price: 2900,
      currency: '₽',
      availableColors: ['Желтый', 'Черный'],
      weight: '270 г',
      dimensions: '21 см x 5 см x 3.2 см',
      material: 'Металл',
      stock: 30,
      warranty: '12 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз'],
      description:
        'Универсальная отвертка для любых задач. Идеальный инструмент для дома и работы.',
      specifications: [
        { title: 'Материал', content: 'Металл' },
        { title: 'Дизайн', content: 'Удобный хват' },
        { title: 'Применение', content: 'Для любых задач' }
      ]
    }
  ];
  

//(аксессуары) обычно относится к дополнительным товарам, 
//которые могут быть полезны или необходимы для основного продукта
  export const accessories = [
    {
      id: 2,
      name: 'Отвертка с изоляцией',
      rating: 4.8,
      salesCount: 400,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/2.jpg',
        '/images/productData/3.webp',
        '/images/productData/4.webp'
      ],
      brand: 'Инструмент Плюс',
      manufacturer: 'ООО Технологии Инструментов',
      article: '459764',
      price: 3300,
      currency: '₽',
      availableColors: ['Красный', 'Желтый', 'Черный'],
      weight: '300 г',
      dimensions: '22 см x 5 см x 3.5 см',
      material: 'Металл с защитным покрытием',
      stock: 20,
      warranty: '18 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз'],
      description:
        'Надежная отвертка с изоляцией, разработанная для работы с электрическими приборами. Максимальная безопасность и комфорт.',
      specifications: [
        { title: 'Материал', content: 'Изолированный металл' },
        { title: 'Дизайн', content: 'Прорезиненная рукоятка' },
        { title: 'Применение', content: 'Работа с электрическими системами' }
      ]
    },
    {
      id: 3,
      name: 'Отвертка ударопрочная',
      rating: 4.5,
      salesCount: 350,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Мастер Инструмент',
      manufacturer: 'ООО Надежность Инструментов',
      article: '459765',
      price: 2500,
      currency: '₽',
      availableColors: ['Синий', 'Черный'],
      weight: '320 г',
      dimensions: '23 см x 5 см x 3.5 см',
      material: 'Усиленный металл',
      stock: 15,
      warranty: '12 месяцев',
      deliveryOptions: ['Самовывоз'],
      description:
        'Прочная отвертка для тяжелых условий эксплуатации. Надежный инструмент для профессионалов.',
      specifications: [
        { title: 'Материал', content: 'Усиленный металл' },
        { title: 'Дизайн', content: 'Противоскользящая рукоятка' },
        { title: 'Применение', content: 'Ремонт сложных систем' }
      ]
    },
    {
      id: 4,
      name: 'Отвертка с магнитным наконечником',
      rating: 4.7,
      salesCount: 450,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Техно Инструмент',
      manufacturer: 'ООО Магнит Инструмент',
      article: '459766',
      price: 3100,
      currency: '₽',
      availableColors: ['Черный', 'Серый'],
      weight: '280 г',
      dimensions: '20 см x 5 см x 3 см',
      material: 'Металл с магнитным покрытием',
      stock: 25,
      warranty: '24 месяца',
      deliveryOptions: ['Курьерская доставка'],
      description:
        'Отвертка с магнитным наконечником для удобной работы с мелкими деталями.',
      specifications: [
        { title: 'Материал', content: 'Металл с магнитным покрытием' },
        { title: 'Дизайн', content: 'Эргономичная форма' },
        { title: 'Применение', content: 'Работа с электроникой' }
      ]
    },
    {
      id: 5,
      name: 'Отвертка универсальная',
      rating: 4.9,
      salesCount: 500,
      image: '/images/productData/Rectangle 30.png',
      imageThumbnails: [
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png',
        '/images/productData/Rectangle 30.png'
      ],
      brand: 'Универсал Инструмент',
      manufacturer: 'ООО Инновации Инструментов',
      article: '459767',
      price: 2900,
      currency: '₽',
      availableColors: ['Желтый', 'Черный'],
      weight: '270 г',
      dimensions: '21 см x 5 см x 3.2 см',
      material: 'Металл',
      stock: 30,
      warranty: '12 месяцев',
      deliveryOptions: ['Курьерская доставка', 'Самовывоз'],
      description:
        'Универсальная отвертка для любых задач. Идеальный инструмент для дома и работы.',
      specifications: [
        { title: 'Материал', content: 'Металл' },
        { title: 'Дизайн', content: 'Удобный хват' },
        { title: 'Применение', content: 'Для любых задач' }
      ]
    }
  ];
  